{"names": "Gryffindor1971", "reviewerLink": "/gp/profile/amzn1.account.AFYATPLMIEZQGXQWABNILJIINZFQ", "reviewTitles": "Good drive", "reviewBody": "Excellent! Only issue I had was I did not know this was formatted in X-FAT32. I bought this thumb drive to put the movies I have on my PC on it so that I could watch them in my living room on my smart tv... after spending a couple hours transferring files to the drive, I plug it into my smart tv and get an error telling me that the drive was not supported. I tried it on my Sony Blu-ray that has a usb slot for external media and it doesn’t recognize the drive either. I tell my husband about it and he says I need to format the thumb drive with a regular FAT32 file system. Well, I did as I was instructed, reloaded the movies after formatting with FAT32 and bingo! Both my smart tv and my Blu-ray can now read the files on the drive! So, if anyone has problems with your devices reading or even recognizing the drive after loading files in the X-FAT32 format, reformat the drive with FAT32 and then reload your files. You should be good to go! SANDISK, YOU REALLY SHOULD LABLE THE PACKAGING WITH THE TYPE OF FORMATING ON THE DRIVE! That would save people a lot of wasted time knowing this in advance!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 3, 2017", "starRating": "5.0 out of 5 stars", "helpful": "532 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Denis K", "reviewerLink": "/gp/profile/amzn1.account.AHVRQ2F6723IXOL2VOYHCVYJLPKA", "reviewTitles": "Flash drive works well, but included software not needed", "reviewBody": "The flash drive works well out of the box. The slider allows the user to protect the USB connector when not in use. It extends the connector and locks it in place when needed. However, the included SanDiskSecure Access software is confusing, because its \"Download for Mac\" document makes it seem that it is necessary to install in order to use the flash drive. But the software is intended to set up encryption and password protection for data on the drive. This is not needed for most users who just want to transfer data. I removed the software installer from this drive to free up space.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 15, 2018", "starRating": "4.0 out of 5 stars", "helpful": "225 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Marc Nuss", "reviewerLink": "/gp/profile/amzn1.account.AHTTBNFY7S4LIGFFFGDOLQ2KBFZQ", "reviewTitles": "Beware of the Secure Vault Feature", "reviewBody": "has fairly good capacity for the $$ but is pretty slow, and, BEWARE OF THE SECURE VAULT feature, as it password protects the files you put in, but then does not recognize the password you used (i even wrote mine down, ensured caps weren't on, and double checked my typing), and then you cannot access the files you are trying to secure, and, there is no way to reset the password, and you have to delete the whole thing...USELESS!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2017", "starRating": "1.0 out of 5 stars", "helpful": "232 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "TimDouglass", "reviewerLink": "/gp/profile/amzn1.account.AEF32MPLGMEEOHGJMGVV2SUGNXUA", "reviewTitles": "Will not work and can't be returned.", "reviewBody": "Seemed OK at first, but the videos I was trying to play from it kept having errors. Tried to re-format and it will no longer function at all. Want to return it, but even though I supposedly have 2 more weeks on the return period Amazon says it's not eligible for return. Totally not happy. Even the promotional flash drives I've gotten at trade shows work better.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 2, 2017", "starRating": "1.0 out of 5 stars", "helpful": "163 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Joesab", "reviewerLink": "/gp/profile/amzn1.account.AFUHBCC7K2XT6VWIHJSLABO4ZQNQ", "reviewTitles": "Worse write speeds of any name brand drive I've had, 4.5MB/s (read is decent at 35MB/s)", "reviewBody": "I was looking for a cheap drive and was OK with 2.0 speeds but the write speeds at 4.5MB/s on this are much worse, about what you get with a cheap give-away drive.Read speeds are a decent 35 MB/s. This drive would be OK if you rarely wrote to it and mostly used it for reading -- or you don't care about the write speed.This is the last SanDisk drive I will buy, I have 3 and they all suck on write speeds.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 8, 2018", "starRating": "1.0 out of 5 stars", "helpful": "123 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Batman", "reviewerLink": "/gp/profile/amzn1.account.AGETSYUITOWSVFFI4GHIEJZKNEQA", "reviewTitles": "Speed Drops out of the box", "reviewBody": "This drive has a speed drop on every transfer, going from 18 MB/s to 2 MB/s. On the files I transferred, there was at least two speed drops each time. For perspective, this meant transfers that should take 1 minute each could take up to 3 or more minutes. The performance was like this out of the box. It's unacceptable for a product to be unable to consistently deliver target speeds out of the box, brand new. SanDisk was a go-to brand for storage, but with this experience it's clear something has changed in the quality. I'd say stay away from this drive and find something with more reliable speeds unless you have alot of time to waste. I'll be pursuing a refund if these speed drops don't stop.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 25, 2017", "starRating": "1.0 out of 5 stars", "helpful": "120 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "SCM", "reviewerLink": "/gp/profile/amzn1.account.AGWVE2WLNK7KCV4Y5XXWVYE4AH6A", "reviewTitles": "Stopped working after a week with a critical error. ...", "reviewBody": "Stopped working after a week with a critical error. Sandisk website says they are aware of the error and there is no fix, only to return it for a refund. The problem ONLY effects the 16gb cruzer.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 4, 2018", "starRating": "1.0 out of 5 stars", "helpful": "58 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AFG3Y6WA5QOUBYKV64GDRDQF3WGQ", "reviewTitles": "SanDisk application not working for Windows 10", "reviewBody": "I could not get the .exe file to update. A window pops up that there is an update and it downloads the update but fails to start the SanDisk software application. Everytime I click on the .exe file it wants to run the update again. I can manually move files to the USB drive but the SanDisk application will not start. The packaging and the product information is vague what operating systems it is compatible with. I read reviews and answers to questions on Amazon stating it works with the Windows 10 operating system version prior to purchase. We also purchased a 32GB SanDisk flash drive(same version)in the frustration free packaging and we are experiencing the same \"won't update software\" symptoms. The product information needs to be more specific for these flash drives.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 20, 2017", "starRating": "2.0 out of 5 stars", "helpful": "52 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "MPM", "reviewerLink": "/gp/profile/amzn1.account.AFHIL4L3ZWEYBWIA3FRBP2PKGAQQ", "reviewTitles": "EXTREMELY SLOW WRITING SPEEDS, THEN COMPLETELY DIED AFTER 10 MINUTES, OTHER PROBLEMS", "reviewBody": "At first the drivers wouldn't load while plugged into a USB3.0 slot, had to plug into USB2.0 to load drivers, not discoverable otherwise. Then I put the flash drive back into the USB3.0 port, and began transferring some music files. About ten minutes go by, I notice that the estimated time for transfer completion is over 2 hours for 28Gb, and write speeds were at 6!!!!!! Mb per second. This is TEN times slower than what normal rates are for USB2.0, and 100 times slower than normal rates on USB3.0. I stopped the transfer, and attempted to click \"properties\" a window pops up, says I don't have permission to access. I try to format the drive, maybe that will work... says the same thing. I literally can't even view the empty folders I just transferred over...A side note... This item's order took A FULL WEEK to be processed, before it even had a tracking number. Took two full weeks to show up.Another side note... This items was placed in the same shipping box as a FOURTY POUND ITEM, and there was a bunch of extra space, with no padding. Flash drive was just hanging out, getting pummeled.A+ transaction amazon! (sarcasm)", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 6, 2018", "starRating": "1.0 out of 5 stars", "helpful": "21 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Roman", "reviewerLink": "/gp/profile/amzn1.account.AEIYSVAP2MVBAJTZEFCFSEHN2T5A", "reviewTitles": "And the Answer is:", "reviewBody": "Why these special objects, in this case, the SanDisk 16GB 2.0 Flash Cruzer Glide USB Drive (SDCZ60-16G-B35), I am told is really quite simple to operate. I promise I can read, but I am typically unhappy when I fumble through todays technology regardless of its presumed simplicity or arranged madness for an over-the-hill type such as myself. I still rely on INSTRUCTIONS in order to make wishes, ambitions, and hopes become a reality. In my youth, it took me two days and a roll of surgical tape to learn to shave, and now I struggle with an object without a razor nor shaving cream, its called a SanDisk and I remain befuddled, too human to ask anyone to tell me how to employ the value of this miraculous technological device. . YouTube seems to have the answers, but again this foreign sounding language associated with todays technology adds to my greying hair and high blood pressure. Any ideas for instruction with this product?", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 9, 2018", "starRating": "4.0 out of 5 stars", "helpful": "18 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=2&reviewerType=all_reviews"}
{"names": "Regi254", "reviewerLink": "/gp/profile/amzn1.account.AHI7CQHVYA2UYH5SE3RVORZG4XXQ", "reviewTitles": "SanDisk is the best!!", "reviewBody": "This is a very high quality USB flash drive, it is an authentic item (to it's brand name SanDisk, a well-known brand to many for their flash drives, & solid-state hard drives. They are also part of \"Western Digital\" which is well-known for their external hard drives. )I'm sure this USB flash drive will survive many years of being thrown into my over-filled backpack for my final few semesters at our local community college. Sometimes I prefer to hang it on my key-ring for quicker access during night classes. Regardless of the reason, I know the SanDisk will still be completely intact at the end of the day. That's why I choose to stick to SanDisk & their durable products.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 8, 2018", "starRating": "5.0 out of 5 stars", "helpful": "20 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Teach", "reviewerLink": "/gp/profile/amzn1.account.AG672DYT5HGR7XWAHGCWDCTPAGZA", "reviewTitles": "DO NOT buy SanDisk ANYTHING", "reviewBody": "All customer service is in India and it's next to impossible to understand them. CSR wanted access to into my computer to \"FIX\" the problem. I refused, a few hours later received a call from the Call Center saying they have an alert about my computer and wanted access to fix the problem. I will never buy anything sandisk again...no AMERICAN CSR, they can keep their product. Founded in Milpitas, CA.PS stick will not close...first use", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 23, 2019", "starRating": "1.0 out of 5 stars", "helpful": "16 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "RCW", "reviewerLink": "/gp/profile/amzn1.account.AELWLYLEW2OJNY3VLN324IQYUBOQ", "reviewTitles": "Avoid this product.  One of two failed on about a week.", "reviewBody": "I bought two of these USB drives 2.5 weeks ago. I have only been using them for about a week. One failed while copying files. I suddenly was notified the drive was empty, then I checked properties and it had 0 space. I removed and reinserted it and my computers see no drive at all. I wonder when the other will fail now. I have drives that are many years old, one went thru the washing machine and is still working. To add insult to injury, the product is not returnable. Avoid this product.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 20, 2018", "starRating": "1.0 out of 5 stars", "helpful": "29 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Moni", "reviewerLink": "/gp/profile/amzn1.account.AG66CQ4NW7GQGBFMYZ4SCPL7HF2A", "reviewTitles": "Good enough secure USB for both Windows and Mac", "reviewBody": "After Kingston acquired IronKey and then killed it after a year we are left without a reasonable solution that will work seamlessly on BOTH Mac&Win OS and one that is not overly complicated.OK - nerds - let's get this out of the way.YES! 128-AES is not military grade.YES! These drives cannot be boiled, hammered, frozen or used in scuba-diving.If you feel like \"tactical\" is your way of life - move on - this is not for you.I am moving on too:If you need reasonable protection that does NOT require SELF-DESTRUCTION after N-Failed attempts - then read on.The is the ONLY drive that allows instant switch between MAC & WIN without the fuss of internal batteries, keys etc.Action is: Plug in - Start App - Type in pwd - work - logoff - doneIf your drive is lost and somebody gets your USB ... honestly ... they will likely try this and that and then just format it for reuse.This encryption will not protect you from government actors or if you are targeted by determined, skilled people with the right equipment ... if that is your problem ... and you are reading this ... all is lost for you. It is too late. Your entire digital world has already been seeded with eyes.For the rest - IMPORTANT!!!!!To install the MAC portion you will have to download it from https://kb.sandisk.com/Place the downloaded PKG file ON THE USB itself.DO NOT start it from the download folder on your Mac!If you start from the Mac then the Admin password becomes the password for the USB too.Instead - place the PKG file on the USB and start it from there.The install then will let you create a USB specific password.Switching between Mac & Win - nothing to it. On Mac start the iOS app on Windows start the EXEThere is no second install on Windows - the downloaded EXE did not install anything. It just recognized the iOS install and all worked fine.Note: I started all from the Mac side. That is. I deleted all files, installed the PKG file (Mac iOS install). Placed the Win-Exe that I downloaded on the USB as well. When I opened the USB on Windows and started the EXE - it behaved as if all was already installed for Windows as well ... all files worked fine.I have three IronKeys (each at > $150) - all worked great until Kingston bought IronKey and killed it. Their Mac support is insanely bad - So Kingston ... now it turns out $15 bucks ... good enough ... thanks for opening my eyes.Will software updates destroy your current files that are in the vault.I do not know - for a few buck you can afford to have two USB's and once in a while sync the few important files you have.If that sync feels like a bother ... oh, well ... that drive is not for you.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 9, 2020", "starRating": "5.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Sarah JG", "reviewerLink": "/gp/profile/amzn1.account.AHTSZTQ2JDFBO77SLAGITTFLJ5MA", "reviewTitles": "Can't be formatted on my computer", "reviewBody": "I have spent hours trying to figure out how to format something that I should just be able to plug in and drag and drop my photos onto. I have spent two days trying to research how to do this. I feel the reality is the USB window should pop up and I should be able to drag my photos into it. I'm sending this back for return oh, it makes zero sense to me. I don't care if it's slow I'm just trying to put my photos on somewhere that isn't going to charge me because everybody wants my wallet nowadays. I'm 26 years old and pretty tech-savvy. There's no excuse for this. I did research performance purchase and people say it is a slow USB but if you do not mind slow speed, and are looking for something that can store a lot. This is the best thing for your buck. However, there's also no point in throwing money out the window. Photobucket, Dropbox, all those apps want to charge me. I'm trying to store it on a tangible device. Highly frustrating when technology doesn't work the way it should.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 10, 2019", "starRating": "1.0 out of 5 stars", "helpful": "6 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "bluspu", "reviewerLink": "/gp/profile/amzn1.account.AGKWPQYOQKPJNYAX3B7KYGZS7MEQ", "reviewTitles": "Slide in/out USB connector unnecessary and weak link that breaks", "reviewBody": "After a couple of months, the USB connector started to flex, and shortly thereafter it failed. These long, skinny USB dongles stick rigidly out of the side of a computer, and even light pressure on the end of this drive (eg setting a laptop down on an uneven surface) bends it at the circuit board connection (see photo of this device disassembled, and the soldered connection that broke when it flexed). The \"slide\" feature makes this worse, and is a completely unnecessary feature (see the Kingston DataTraveller Micro for an example of an exposed USB connector that doesn't need to be \"protected\" by a flimsy sheath.)", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 19, 2020", "starRating": "1.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Mark Lewis", "reviewerLink": "/gp/profile/amzn1.account.AH67H3DNNBMLHZTYPFNUSH7IIG7A", "reviewTitles": "They work great when they work.", "reviewBody": "I bought 2 of these at the same time, after about 3 months one of them quit working on everything except my computer.(This isn't the 1st SanDisk unit that failed me) Since it was past the return time, I contacted the company directly to ask them for a replacement or some help, which they didn't want to do, instead sending me a link to download a program that my computer refuses to download due to security issues, so it could be formatted to the original format. I've tried to bypass the issue, but no luck. I'm actually not very satisfied at all, and I will never buy SanDisk storage units again.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 20, 2021", "starRating": "1.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Austin David Lilly", "reviewerLink": "/gp/profile/amzn1.account.AHD47KWBA3VGGJAGSVF5KTLY2ACQ", "reviewTitles": "Wonderful, a Fav", "reviewBody": "Works as it should. I purchased this particular item because it's from SanDisk and I'm not at all disappointed.16 God so loved the world that he gave his one and only Son. Anyone who believes in him will not die but will have eternal life. 17 God did not send his Son into the world to judge the world. He sent his Son to save the world through him. John 3:16,17 NIRV 18 Whoever believes and has decided to trust in Him [as personal Savior and Lord] is not judged [for this one, there is no judgment, no rejection, no condemnation]; but the one who does not believe [and has decided to reject Him as personal Savior and Lord] is judged already [that one has been convicted and sentenced], because [b]he has not believed and trusted in the name of the [One and] only begotten Son of God [the One who is truly unique, the only One of His kind, the One who alone can save him]. John 3:18 Amplified Bible 15 And if anyone’s name was not found written in the Book of Life, he was hurled into the lake of fire. Revelation 20:15 Amplified BibleRevelation 20:15 Since everyone who goes before the great white throne is to be tried and sentenced for his deeds, and no one is sinless, the only way to escape condemnation and the “lake of fire” is to have one’s name in the “Book of Life” through authentic faith in Jesus as Lord (see Ps 69:28; Phil 4:3; Rev 3:5). Amplified Bible Study NotesGod bless you!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 17, 2019", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "stannousflouride", "reviewerLink": "/gp/profile/amzn1.account.AF7UBRYFKPVM4BKORJP2JNOHD64Q", "reviewTitles": "Excellent value storage product", "reviewBody": "I'm giving the same review to two relatively identical products. This device holds 16GB which is more than enough for regular documents and even some larger picture files. Too much bigger and, well, that's a lot to carry around with you in my opinion.This is the perfect compromise to me, and the product is exceptionally easy to use. Sandisk has outstanding software built in, and if you are, for instance, scanning onto this medium the sw will create a folder for you and give the file a unique name.My only criticism is across the board, all products, all makers, all sizes: these things aren't that tough and could be crushed if something heavy fell on them. I would be happy to pay more and give up some size to get a more indestructible housing.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 4, 2020", "starRating": "5.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=3&reviewerType=all_reviews"}
{"names": "Frank (Tampa Bay)", "reviewerLink": "/gp/profile/amzn1.account.AHFIB6DVQ4LXXROFZY33BFJ3UOSA", "reviewTitles": "Awful Performance during \"Smart-HDTV\" Photo Slide-Show", "reviewBody": "I was actually delivered a USB-3.0 version of this Flash-Drive(SDCZ600-256G)I re-verified my order .... yesI had ordered the USB-2.0 version,and the huge sealed package (bigger than a sheet of paper)that it was delivered inhad USB-3.0 markings in many places.Normally, this is a big upgrade,but why was the 3.0 version listed at a lower price? (maybe ...)Before using this Flash-Drive,I removed the \"SanDisk SecureAccess software\",so there would be no possible S/W \"interference\"I bought this Flash-Drive for only one purpose .....Transfer pictures & videos from my computersto my \"modern\" Samsung \"Smart-TV\"for playback using the USB (2.0) outletsI have been using a Flash-Drive (3.0) for yearson my HDTV with satisfactory resultsHowever, from the initial \"Get-GO\",just the very simple playback of photos on the HDTVwith this SanDisk Flash-Drive was a MAJOR-DISAPPOINTMENT !!!During a slide-show (normal playback speed , with no audio),before every few photos there would be around a 10-second delaywhile the next photo was being loaded for view(\"Loading\" status shown for the entire period)Thinking that maybe the HDTV was having a problem,I then installed my original USB-3.0 Flash-Drive (a different brand)and the subsequent slide-show ran normally(max of 1-sec to load the next photo)The photos that I was viewingwere JPEG format of typically \"average\" size (3-MByte & less)I then had my PC (with also an USB-2.0 drive) do a thorough \"Error-Checking\" scanof this Sandisk Flash-Drive which took maybe 10-minutes to completeNo errors were found on the Flash-Drive by the windows utilityBoth of the above Flash-Drives that I were usingwere formated FAT32Maybe this Flash-Drive has acceptable read-write performanceduring more typical computer applications,but for my intended purposesit has now been relegated to the proverbial \"Junk-Draw\"", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 25, 2018", "starRating": "2.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "Coolpens", "reviewerLink": "/gp/profile/amzn1.account.AFNNTKKHBLQ5V4DSTQYE7WHQQLNA", "reviewTitles": "Drives write protect themselves.", "reviewBody": "This drive all of a sudden became write protected and everything I have tried will not remove the write protection. It appears from other reviews online that this is a known problem with these drives and there is no way to regain control of the drive. The only option appears to be to try and get a replacement from SanDisk. But that means you have to return the defective drive with all your files on it because you cannot delete them. Very disappointed!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 21, 2020", "starRating": "1.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "Dennis W", "reviewerLink": "/gp/profile/amzn1.account.AEQLQWJ25DKGSLRAF5WZ5JOXDAYA", "reviewTitles": "ALWAYS SANDISK", "reviewBody": "There's lots of brands of knock offs out there and sell for a tad bit cheaper, but you'll find that Sandisk never fails to disappoint. This is a true story, I bought a 1GB usb sandisk thumbdrive about 16 years ago, it was in storage with many other items. The storage unit i had was shady and crap. I found one of my boxes with computer stuff along with my sandisk under a few inches of water. Everything was trash, after cleaning the little bit of rust of the external conductors, this Usb drive was the only thing that survived. I have also recycled the same Sandisk SSD drive for my desktop for the last 3 builds, almost 7 years old now. So do you want to save maybe a little money and gamble with ABC brand or get the one that has lasted the test of time.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 21, 2021", "starRating": "5.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "John", "reviewerLink": "/gp/profile/amzn1.account.AF6FGBP2UGOXPE4FUEJ44YB6RTYQ", "reviewTitles": "Trash", "reviewBody": "I seen nowhere about that there was a file limit on transfer but there is. I should have read the questions asked first before buying.Who puts a 2 gig file transfer limit on a 128 gig usb? Buyer Beware!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 14, 2021", "starRating": "1.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "RCL", "reviewerLink": "/gp/profile/amzn1.account.AHA5ULPNYUCB2TYB4WUXIDAWOVMQ", "reviewTitles": "Unable to Use", "reviewBody": "Bought this to back up some documents on PC. Soon as I put the drive in port, my Kaspersky Virus went to high alert. After trouble shooting, the presence of the thumb drive caused problem w Kaspersky. I had to uninstall/reinstall virus software to get PC back to norm. Wonder if any1 else had this issue? Waste of $$ bc I do not dare put it back in thumb drive. And my PC is a fairly new Dell & I have used these ports in the past & never affected my virus program. Def something wrong w flash drive I received.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 1, 2020", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "Russell A. Starner", "reviewerLink": "/gp/profile/amzn1.account.AHCKL7LTUGNLDJH4DK7FEHFAXOEA", "reviewTitles": "SanDisk Cruzer CZ36 16GB USB 2.0 Flash Drive (more is better)", "reviewBody": "I like using these drives as they are very easy to use for any kind of data that you need to store for a short period of time. I just cleaned off some files that I don't use much on these drives and now I can reuse them again. The prices for these drives are a really good bargain and I will be stocking up again on different size drives from this vendor. I found that if I know that I will be accessing programs that need to be installed on my computer, I'll put the needed software on the flash drive.Since I use assistive technology on my computer, I plan to add all of them to a flash drive.I fond that when put audio books on these flash drives that I can hold many books and it makes reading them all a joy.You will want to make sure that if you use a Digital Talking Book Machine (DTBM) that the drive has the FAT32 file system. If it is in a different format (like exFAT or NTFS) the player will not read the drive and call it an error.You can secure the drive with the free software that is on it. I never had a reason to do so but I clear it off and keep it in a safe place.The best trick I found is to put a copy of your passwords on a drive like this along with other needed programs to help get your back up and running from a system restore.I'll be buying more as I find th need.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 6, 2018", "starRating": "5.0 out of 5 stars", "helpful": "6 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "ptl4now", "reviewerLink": "/gp/profile/amzn1.account.AFD5SIHSJE5M4YWJXEX3FF3TNPLA", "reviewTitles": "BEWARE SANDISK- Suddenly, its WRITE PROTECTED, and It can't be unlocked to USE it!!!", "reviewBody": "I will never buy another Sandisk Product. it became write protected within a month or two of purchase, and I have been unsuccessful at clearing this. I don't know how this feature was enabled, or how to fix it. I tried a couple things I googled, but alas, it remains unfixed. I went on vacation right after I discovered this, its months later, no way to return this defective product. Its my last Sandisk purchase.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 17, 2020", "starRating": "1.0 out of 5 stars", "helpful": "6 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "Amazon Customer", "reviewerLink": "/gp/profile/amzn1.account.AELKKH6HR5K33BS5VUDHVYVQDHZA", "reviewTitles": "Works great despite poor packaging by Amazon", "reviewBody": "I needed a flash drive quick and I decided to try this one. When I opened the package I realized one side of the package was crushed which was no surprise since Amazon sent it in a basic envelope with No protection. The metal end was crushed from both sides. Sending it back was not an option do to time constraints so I carefully pried both sides back to their original positions as best as I could. I was able to plug it into the computer and download needed files with no problem. This flash drive is obviously well built considering the abuse it took in shipping. I definitely would buy one again and hopefully Amazon improves their packaging. It's the second time I've received something in only an envelope.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 17, 2018", "starRating": "5.0 out of 5 stars", "helpful": "8 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=4&reviewerType=all_reviews"}
{"names": "Mother of Twins", "reviewerLink": "/gp/profile/amzn1.account.AHCJGHD62FB6GRXLJ5K77JTEAAHQ", "reviewTitles": "Can fit on a key ring", "reviewBody": "Yes, it has a built-in loop you can put on a key ring.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 10, 2018", "starRating": "5.0 out of 5 stars", "helpful": "16 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "George McGinn", "reviewerLink": "/gp/profile/amzn1.account.AHFB2TUENX2UHZHHFDMDEWOHU6RA", "reviewTitles": "Great for use in the new THE64 computers", "reviewBody": "After having issues with my current flash memory microSD cards that I use for my Raspberry Pi when used in THEC64, I decided to go out and get three of these 16GB flash stick cards, and my problems disappeared (except for possibly some new firmware upgrades that may need to be done, but I’m still researching them).If you’re looking for flash sticks to use in the newest THE6 for computers, I highly recommend these. They will format with FAT32 and MBR (that master boot record) which is required for every external Storage device that you plan to use with the newest Commodore 64 clones. They are the right size as far as maximum memory that the users guide suggests that you use, and you can label them change them admin folders there’s plenty of space for expansion if used on 8-bit machines.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on September 17, 2020", "starRating": "5.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "JRM", "reviewerLink": "/gp/profile/amzn1.account.AFT5P5TGXEBFHQDQPSU7COEQGTPQ", "reviewTitles": "Worked okay for awhile...", "reviewBody": "The only thing that I don't like about it is how easy it is to press that red button and push out the USB part. I used to hang this from my keyring but it was always coming out and I didn't like that. I bought one of those flash drive cases and put it in there for more protection. Other than that, for the storage capacity of this thing and the price, it was a good deal. SanDisk makes good products in this category and I expect this thing to last me for quite a while.UPDATE: Became read-only and cannot be erased/formatted/used. All I can do is copy files from it. Useless. For the price, this should have lasted a bit longer. I have always considered SanDisk to be a reliable brand, but am now changing that opinion based on my experience and the other reviews. Think I'm going to buy a slim external drive to use instead.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on May 18, 2014", "starRating": "1.0 out of 5 stars", "helpful": "23 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "GreenViper", "reviewerLink": "/gp/profile/amzn1.account.AHT63FKBOKVKDVMMRNRGZOXOJIHA", "reviewTitles": "Very poor, Waste of money", "reviewBody": "Well, I purchased this drive so I could download Windows 10 Pro for my new pc build since I couldn’t find my other usb at the time. I plugged it in and it worked nicely the after the install on the new gaming rig it stopped working? I only used it once and have been trying to get it to work with no success. This item has bricked and a total waste of my money and time. Such a let down!NOTE:If you're only going to use this item for a one time use then get it. But anything after that it's unreliable and there is no support for this item from the manufacture. Or in any of the \"HELP\" sections on there web page even the live representative told me there is nothing they could do for such a small ticket item?", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 1, 2018", "starRating": "1.0 out of 5 stars", "helpful": "5 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "David", "reviewerLink": "/gp/profile/amzn1.account.AG27FUU72YO4VHRIC2WAEMD4ZW2A", "reviewTitles": "Fine for small amounts of data and Mac bootable Installation drive", "reviewBody": "For all capacities and all brands, given the dismal transfer speeds of 99.99% of them, I've abandoned their use in favor of portable SSDs. Even the cheapest SSD you can buy is magnitudes of speed greater than them. I bough a 128 GB one to transfer 90GB of data to other computers. That was a mistake; I didn't have all day, literally, to do that.My fix: bought a 250 GB PNY non portable SATA SSD and put in on one of my Sabrent USB enclosures. Even in USB-A ports, transfer speeds were in the 450 MBps and not the 1-10 MBps of our flash drives.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 24, 2021", "starRating": "4.0 out of 5 stars", "helpful": "3 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "walt", "reviewerLink": "/gp/profile/amzn1.account.AFR6WTQWPJSJUNXVGAIG64TNCLZA", "reviewTitles": "Dead from Sitting in a drawer", "reviewBody": "I bought this in 2016, filled it up with pictures, put in a zip lock bag, put into my desk drawer. Have not used it since. Today, I needed some pictures off it, plugged it into my laptop, same one that I put the pictures on it from, it would not read it. \"Corrupted\". I then put it into another laptop, same thing. I tried to do several things to get the pictures off it, no luck. Tried for an hour, nothing. Neither computer could not read it. I could not format it either. No clue as to why. My other sandisk usb works good (newer model) but not this one.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 31, 2019", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "The Knight's Squire", "reviewerLink": "/gp/profile/amzn1.account.AHGHROE2MDEDQCRM5IU5IRJITQHQ", "reviewTitles": "Only 29GB Super Slow", "reviewBody": "I bought a 32GB stick for school work and video presentations. Get the drive stick it in my PC and format it when I notice instead of 32GB, I only have a storage capacity of 29GB. Now, this isn't a new thing to me and realize that you will usually get a little less storage than you bought, but I don't think I've ever had 10% less capacity. Also, for some reason, the write speed is super slow, much slower than one would think. I had an 899mb video file take almost 5min to transfer to the USB drive. For the price, it is OK, but I might return it as it's not as advertised.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 23, 2020", "starRating": "3.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "Djuli", "reviewerLink": "/gp/profile/amzn1.account.AFU5UFNFMP6S2JHQIZVG3D6HWTGA", "reviewTitles": "Fickle", "reviewBody": "I have several Sandisk USB flash memory sticks. They’ve lasted me quite a number of years. The data is still readable. Thought I’d stick with this brand when I recently needed another one. For some reason, it’s fickle with my Windows 10. I have to insert this stick in several times or try a different port in order for Windows to recognize it.In time, the snap-lock feature will go bad and won’t snap shut. All in all, I’m pleased with my purchase though. Just will stay away from this brand because of my recent experience.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 15, 2021", "starRating": "4.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=5&reviewerType=all_reviews"}
{"names": "A Humble Opinion", "reviewerLink": "/gp/profile/amzn1.account.AFSH5QVIIIXYRBKIXB4SOOCNAQCQ", "reviewTitles": "Will not work on Mac", "reviewBody": "I have bought many SanDisks through the years and have had no issues, but the one I bought Oct 2021 will not work on my Mac Air/Catalina OS. Every time I try and copy a file, I just get the Error 43. I have pulled out old sandisks and tried to copy the same files with no issues. When I compare the two sandisks via disk utility, the only difference (other than GB size) is 3s1 vs 2s1 beside \"device\". The newer one with issues is the 2s1.I have no idea how to solve this problem. And I'm afraid to buy another.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 7, 2021", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=6&reviewerType=all_reviews"}
{"names": "Michael", "reviewerLink": "/gp/profile/amzn1.account.AGA44D3M4WU36RWFHQS73KF2OVGQ", "reviewTitles": "Suits my car stereo digital music needs.", "reviewBody": "I bought this for use with my car so that I can play mp3s. I got tired of buying expensive iPods and then having them die after around two and half years of use. My car stereo will play music from other mp3 manufacturer devices but the stereo does it in USB mode because its default software is for iPods. So why bother buying another brand of an expensive mp3 player when an inexpensive flash drive works exactly the same? I'm very happy with this flash drive for the purpose I bought it for.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 21, 2020", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=6&reviewerType=all_reviews"}
{"names": "Bob L", "reviewerLink": "/gp/profile/amzn1.account.AE3G4VUOGUZM6I5ZK6IA5T3MGULA", "reviewTitles": "JUNK, DO NOT BUY", "reviewBody": "ITEM CAME IN AND THE PACKAGE WAS PARTLY OPEN ON THE CORNER. PLUGGED IT IN TO THE USB SLOT AND IT DIDN'T WORK. i TRIED IT IN ALL MY 7 USB PORTS TO NO AVAIL. I TOOK ANOTHER OF MY THUMB DRIVES AND IT WORKED FINE. i DID A CHAT SESSION WITH SAN DISK AND ALL THEY WOULD TELL ME WAS TO RETURN IT TO WHERE YOU PURCHASED IT. THE PERSON I CHATTED WITH (PAUL) TOLD ME HE WOULD CHECK AND SEE IF HE COULD REPLACE IT AND E-MAIL ME (HE LIED). i WILL NEVER PURCHASE SAN DISK PRODUCTS AGAIN. MY RECOMENDATION IS TO ANYONE NEEDING A QIALITY THUMB DRIVE IS TO GO TO \"PNY\" AND IT WILL WORK.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on May 5, 2021", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=6&reviewerType=all_reviews"}
{"names": "W. Richards", "reviewerLink": "/gp/profile/amzn1.account.AERDSO4RQ6SBTMYM3V6FPLWB7M6Q", "reviewTitles": "Typical low-cost USB drive - but why get USB 2.0 at this point?", "reviewBody": "As many other reviewers, I am using this for installers and disposable low-priority purposes. As far as drives of this type, it performs typically... it does better with large files, sequential transfers, and more poorly with writing files and smaller file sizes.I thought it might be nice to try a USB 2.0 drive to see what the write speeds are (just as low as the USB 3.0 drives, it turns out). Even if your device only supports USB 2.0, you might as well get a USB 3.0 drive, since there is practically no price difference, and the USB 3.0 drives will work better if you ever need to connect them to a reasonably modern computer.I tested with the drive plugged directly into a USB 3.0 port. The drive maxed out around 29MB/s, which seems about right for USB 2. It crawls extremely slowly with small files. Based on the manufacturing, I expect that the drive would not last forever, and might fail easily, but I haven't tested or encountered this yet.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 24, 2019", "starRating": "2.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=6&reviewerType=all_reviews"}
{"names": "Robert J. Bodnar", "reviewerLink": "/gp/profile/amzn1.account.AFIPWHUJNZEQMNNI24XUGBCDJK7A", "reviewTitles": "Large is Better,", "reviewBody": "I used kits to make older hard drive Bunk Thumb Drives. Going through a number of rebuilds. That is what I did with the older drive made them storage bricks. Used them to play PC Games that take up all my space and performance.. It is all a matter of USB speed. Great plug and play for those games. When the PC Crash I would lose the games that are stored on the PC. But for traveling no fun with them. I do large research projects and video and audio something part of the report. This fits the bill.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 30, 2021", "starRating": "5.0 out of 5 stars", "helpful": "8 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=6&reviewerType=all_reviews"}
{"names": "James Klein", "reviewerLink": "/gp/profile/amzn1.account.AHIUB7F4S6OPOQXTO2NPXWMZFQXQ", "reviewTitles": "NOT WORKING : This unit is not recognized on any Mac or PC computer.", "reviewBody": "Received this SanDisk Cruzer 128GB a while back (Christmas maybe?). Kept it on my desk in the package for a few weeks before I needed to use it. Opened it today to find out the unit is not recognized on anything you connect it too. I tried most of the things I know how, format it, try it on different computers, etc. I checked for some troubleshooting ideas and found a LOOOONG list of video, articles, and tutorials pointing these out as basically no good. I am surprised SANDISK allows this to go on. Very disappointed in the overall experience - too late to return it now, so instead I recommend my fellow Amazonians to avoid this product until Sandisk decides to do something about it.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 22, 2019", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "Cortney", "reviewerLink": "/gp/profile/amzn1.account.AENEX7ELNZ5LNCK4ST3QOMNYFIAQ", "reviewTitles": "Unusable. Wish I'd checked sooner.", "reviewBody": "My computer can't read or format this flash drive. I tried formatting using the standard right-click, the command prompt, the disk management utility, and the diskpart adminstrator prompt. This is all after placing it brand-new from the box into my laptop's USB port.I bought it a while back and didn't need it til now, but now I'm wishing I'd had the foresight to investigate it before realizing I bought a dud. :/", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 21, 2019", "starRating": "1.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "Melvin Bridgmon", "reviewerLink": "/gp/profile/amzn1.account.AF5FFAPVZEAVLE4TYKBP27FMU5EQ", "reviewTitles": "Does Work Properly", "reviewBody": "Please backup your data. If you use the San disk secure access. Or don't use it at all. This feature has habit of forgetting your password. That means your files will lost forever. And it has another habit of keeping files or folders open. After I have deleted or closed them. Which means I couldn't eject the drive. I had to pull the flash drive out of the computer. Without being ejected out of the computer. It has been decent on the write speed and capacity.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on June 4, 2020", "starRating": "3.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "TexasJohnny", "reviewerLink": "/gp/profile/amzn1.account.AFBUQLBQ3RICCTQOJ6ZMX5KE5XAA", "reviewTitles": "Great thumb drive for multiple purposes", "reviewBody": "Cloud drive this, that, and the other - BLAH BLAH BLAH. I've worked in IT and InfoSec long enough to tell you sometimes you just need to make a local backup with your computer disconnected from the network in the event you fear corruption from a virus, malware, or ransomware. I keep a rotating set of thumbdrives offline with a 2 month history and one of my 128GB drives acted a bit sketch so this is an excellent replacement. Tested and read and write speeds excellent. Would recommend.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on May 13, 2021", "starRating": "5.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "elf", "reviewerLink": "/gp/profile/amzn1.account.AESHYRTLBP4EB73NKKZI6AD4WEGQ", "reviewTitles": "FAT32 not exFAT out of the box!", "reviewBody": "Basics SanDisk 2.0 USB high capacity flash drive no mystery there but what threw me for a loop is these are FAT32 format out of the box whereas all previous SanDisk drives I've bought greater than 32GB have been Factory formatted exfat maybe these are from Israel where I read the standard out-of-the-box is FAT32? in any case I consider that a benefit and what they should have been doing for years because FAT32 is the only format that's cross-compatible between PC Linux iOS routers and set-top boxes. The only drawback is not being able to use files larger than 4GB.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 30, 2019", "starRating": "4.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "Ra", "reviewerLink": "/gp/profile/amzn1.account.AHPHS6ZOMBV3JXKY2CSTTROEGQ6Q", "reviewTitles": "Do not skimp on your thumbdrives!", "reviewBody": "These devices are not expensive. This is not the place to save a few pennies. My sound booth is out in my shed and I access the internet from the computer in my home. I am constantly yanking this Sandisk drive out of one machine and plugging it into the other one and it holds up to the abuse. Using a USB hub adaptor such as this also makes life MUCH easier; https://amzn.to/3t0TH1O Make sure to get one with a 2.5 foot cable, like that one has. Many of them are only a few inches long and are hard to work with.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 26, 2021", "starRating": "5.0 out of 5 stars", "helpful": "4 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=7&reviewerType=all_reviews"}
{"names": "Steve", "reviewerLink": "/gp/profile/amzn1.account.AEAI4QOB7NSSMAWLN4BDIK6NPQ4A", "reviewTitles": "Bought 6; 2 Failed; Cannot access or Format", "reviewBody": "Two of the six SanDisk drives failed. Ironically, the bad ones were the last i opened recently so they are way outside the return date. I purposely buy brand name drives as \"insurance\" since data stored on them is important. When plugged into a USB port I receive a message that the drive needs to be formatted. However, Windows 10 cannot format the drive. I have tried multiple times on multiple computers to get these 2 drives to function properly but have not had any success. While the other 4 drives have been fine it does concern me and i will be sure to backup all data stored on these drives. Finally, when checking the properties of the drives, it reads them as totally full/used but no files appear on the drives.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 7, 2019", "starRating": "1.0 out of 5 stars", "helpful": "2 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "Calvin", "reviewerLink": "/gp/profile/amzn1.account.AFG5IGXESTG7XHI55IWXBQSL6SBA", "reviewTitles": "Yes it works with the Playstation Classic", "reviewBody": "I picked up this flash drive because it was suggested by several people on Reddit as working on the Playstation Classic. I can confirm that I have it running with Autobleem via the OTG setup with no issues. It's quite fast too, compared to some of the other drives I was able to make work, I've not noticed any stuttering on any PS1 games loaded onto it.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 8, 2019", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "LA", "reviewerLink": "/gp/profile/amzn1.account.AFNZGBMXX3UXBJUQGTNBGKNWU2VQ", "reviewTitles": "Easy to use! Lots of storage for important documents!", "reviewBody": "This is so easy to use and has amazing storage capability! As an author, yet someone who ISN’T very tech savvy, I used to worry that if something happened to my laptop all my hard work would be gone- now I have this to back everything up! It’s great!I highly recommend it!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 27, 2021", "starRating": "5.0 out of 5 stars", "helpful": "10 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "WaTsKy", "reviewerLink": "/gp/profile/amzn1.account.AGG3XFJKRTBWSJ4RHWOJTHACQYEQ", "reviewTitles": "✡✡✡ Great added storage for RetroPie, however cheap build quality, finicky USB connection, and poor transfer light ✡✡✡", "reviewBody": "I built a Raspberry Pi and installed RetroPie. I wanted to have more storage and I wanted to spend less than a micro SD card. I didn't need USB 3.0 since the Raspberry Pi only has USB 2.0, so I picked this bad boy up in the 128 GB flavor.APPEARANCEThe USB stick itself is two tone black. There's a matted black and a piano glossy black. The slider which reveals the USB female connector is red. The actual build quality of the USB stick is very cheap. The plastic feels very thin, which makes the entire stick feels flimsy. Be gentle with handling the device. Especially with the female connector protruding. If you're looking for a rugged device this may not be what you're looking for.FUNCTIONALITYLots of people have already posted pictures of read write speeds, so I won't post that. What I will say is that I get between 4 - 11 MBps in real world usage transferring files from my pc and this stick. When going from the stick to my pc I get between 24 - 27 MBps. Within the indentation of the slider is where you will find the transfer light. Regrettably, the light is very faint. SanDisk probably did this to conserve on power consumption. Also, the location of the light is too close to the slider. At times, it blends with the slider making it even harder to see. I would have liked to see the light somewhere more prominent such as the very back of the stick on the matted section. Another issue I have is that sometimes you do not get a good connection causing the pc to not see the stick. The light still comes on but the pc does not register the device. To fix this I re-plug it in.PROS■ Good price / storage ratio;■ No random disconnects (yet); and■ Okay transfer speeds.CONS■ Larger than I hoped for;■ Dim transfer light;■ Poor location for transfer light;■ USB connection is sometimes finicky (Once it's connected the stick is fine no random disconnects); and■ Cheap build quality.I know that there are a lot of cons to this stick, but it's not a bad stick. The price more than compensates for the issues and I haven't run into any fatal errors with the stick as of now. If that changes I will be sure to update my review.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 29, 2017", "starRating": "3.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "MonetLover", "reviewerLink": "/gp/profile/amzn1.account.AGCTCMPPNL3SLDUEV3J3KPKARZNA", "reviewTitles": "Some Computers Don't Recognize It", "reviewBody": "Some of my Windows computers don't recognize this USB when I insert it. I don't know what the problem is, but it is disappointing that I can't move files from one machine to another, which obviously is why I bought it. When moving files from one 64-bit machine to another 64-bit machine, it does not recognize the drive at all. ??Also don't like the fact that it lights up and stays lit, instead of flashing only when it is writing. Not happy with it.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 12, 2020", "starRating": "2.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "DSutphin", "reviewerLink": "/gp/profile/amzn1.account.AGCVELWVK6K4YTBPKBD54RPXZFGQ", "reviewTitles": "Perfect for my picture storing needs", "reviewBody": "This is exactly what I need in a storage device. No more of those flimsy SD cards this is more durable. No more losing those tiny little SD cards, because this is a good size that it's hard to misplace. It is what I prefer in a storage item because it easily plugs in to all my computers. It is super easy for those computers to recognize it & open it and even easy to transfer photos on or off of it. This is what I will be buying more often. The only down side from typical SD cards is this won't store as easily if you buy multiple ones but that's not a deal breaker for me. I'll take this size, convenience, and the functionality it offers over highly priced SD cards.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 3, 2019", "starRating": "5.0 out of 5 stars", "helpful": "13 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=8&reviewerType=all_reviews"}
{"names": "Sue Weaver", "reviewerLink": "/gp/profile/amzn1.account.AGJAI3HVL7YDW7HN36GGJREJXQ4Q", "reviewTitles": "What gives?", "reviewBody": "These are very nice thumb drives but I've purchased them from three different sellers and the encrypting feature has worked on only 2 out of 7 drives. Both of the ones that worked came from this seller.What gives?! If you want to store non-encrypted files, they're great. If you're looking for encryption capability, definitely look elsewhere!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on July 12, 2021", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=9&reviewerType=all_reviews"}
{"names": "Above Average", "reviewerLink": "/gp/profile/amzn1.account.AFMISYHF3V4HHITPBVQMAF5YC3VA", "reviewTitles": "Critical Review", "reviewBody": "I must say, i love the security feature. The files in the vault are completely invisible when the drive is opened by another person, only a password can make the files visible.I have seen the negative reviews, and so far i have been fortunate enough to not be burdened by such experiences. Maybe those persons received a factory fault item, but who knows? If anything changes, i will be sure to update my review to encourage or warn others whether to buy or not.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on October 15, 2020", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=9&reviewerType=all_reviews"}
{"names": "Robert Casper", "reviewerLink": "/gp/profile/amzn1.account.AF2KBATRJYEEW7S3RJSO4YINKQHA", "reviewTitles": "Not worth it", "reviewBody": "When I got it the slide didn't lock so that was a pain. Also, don't forget that 32gb's is only 28gb's on the actual product. I would normally return it but I'm not going to waste my time for $7 and I really needed it today so I can't wait for another to arrive so I'm instead going to write this review and never buy this product again. Just look around for another brand at this price and you'll feel better.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 14, 2020", "starRating": "1.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=9&reviewerType=all_reviews"}
{"names": "Hillary", "reviewerLink": "/gp/profile/amzn1.account.AG2NBBMOFGKLRWY6GSEGZHXTQ3DQ", "reviewTitles": "Second time buying one. Loce", "reviewBody": "This is my second time buying this brand. I think this is the best thumb drive on the market... I needed something that would withstand being taking in and out of a computer A LOT! I’ve had crappy thumb drives in the past that have broken because they were “overused.” This one feels solid and doesn’t feel like it will break. I bought the largest size and it holds a lot of RAW photos. Super fast too. I frequently edit photos straight from the thumb drive and I’ve had no issues with it being slow. Definitely great value for your money!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on November 1, 2018", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=9&reviewerType=all_reviews"}
{"names": "gkhelland", "reviewerLink": "/gp/profile/amzn1.account.AEGFFH5RWY7KQZT3HLOKAMK3JZ5A", "reviewTitles": "SanDisk is the product to choose for your USB device", "reviewBody": "SanDisk is my go-to product for a USB device. Easy to use, convenient, and affordable. I have several and in different sizes (16GB, 32GB, 64GB, 128GB and even a 256GB). I store various things on them. With one of my 16GB USB devices, I store information for my photography group and for the classes I teach at a senior center on photography and computers. I have all my documents for those meetings and classes copied to that USB device and use it in my presentations. Definitely recommended!", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 16, 2020", "starRating": "5.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=10&reviewerType=all_reviews"}
{"names": "Modern consumer", "reviewerLink": "/gp/profile/amzn1.account.AGKZUDT6LQOW5PTTOI6MJP356ZSQ", "reviewTitles": "Works great for a little while, and then shuts off", "reviewBody": "This is my third Sandisk flash card, and they all worked well for a short period of time, like a couple of months. And they just shut off, by themselves. One day, I could not use them. It refused to be opened on my Macbook, and now it is just loading on my desktop. I cannot open it, use it, or anything. And finally my desktop says it does not recognize any flash drive inserted, and so please insert a new one. It is quite frustrating, especially when I am in the middle of preparation for finals week.I am looking for new flash drive, and not a Scandisk.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on December 3, 2020", "starRating": "2.0 out of 5 stars", "helpful": "5 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=10&reviewerType=all_reviews"}
{"names": "Paul I.", "reviewerLink": "/gp/profile/amzn1.account.AHHFNRHW4D2D644BBPRKZWRINRVQ", "reviewTitles": "I use an ECC system.", "reviewBody": "This thing is fast. I don't care about what they say about USB 2.0, as it's faster than any other USB storage stick that I've ever used.This thumb drive is just perfect for my work documents. I work from it every single day. It's just that it would be nice if they made one that's bigger, like 256 GB. I could probably use one like that someday.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on March 9, 2017", "starRating": "5.0 out of 5 stars", "helpful": "7 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=11&reviewerType=all_reviews"}
{"names": "Roy C. Lewis", "reviewerLink": "/gp/profile/amzn1.account.AHZXTSTUS5VTYXLOA6NYHA5YVNDQ", "reviewTitles": "Formatting", "reviewBody": "This drive was purchased to hold a Truecrypt encrypted file container.In Truecrypt, it just would not format successfully, using any file system, until the size of the container was set to a multiple of 512 (supposedly a block size used by Truecrypt (??).After 4 days of experimenting, I found that out, and got a successful format.A Truecrypt format takes about 4 hours when done by a powerful laptop (Thinkpad W520, hottest CPU).Now, all seems to work reliably. I believe that trouble was with Truecrypt and not this drive.I related this in case others wanted to use this drive in the same manner.Regular formatting seems normal.The drive seems a little slow, but so far, seems reliable. Transfer rates were similar to other posters.The indicator light is inside the drive, making it hard to see because of the slide mechanism covering the center portion.Mounting the light on top, at the end of the drive would have been much better.I like the storage capacity and the tip being protected when not in use.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on February 7, 2013", "starRating": "4.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=11&reviewerType=all_reviews"}
{"names": "Dale in Tennessee", "reviewerLink": "/gp/profile/amzn1.account.AGFXKU73F46Y2B7WNW5G5BEFSGJQ", "reviewTitles": "Functional, Sturdy Backup", "reviewBody": "I use these not only for portability but also for off site backup to our safety deposit box, rotating them out periodically. They are not the fastest on the market, but I have yet to have one fail.I don’t care for the encryption software, so do yourself a favor and get something more robust and with greater security (hence the four stars instead of 5).At any rate, this is a good value for what it does. In my case, that is off site backup and modest portability.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 29, 2019", "starRating": "4.0 out of 5 stars", "helpful": "3 people found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=11&reviewerType=all_reviews"}
{"names": "NezoGoku", "reviewerLink": "/gp/profile/amzn1.account.AGFEQNFD7EIS5OXWTRVZY5JNGBIA", "reviewTitles": "Pretty long lasting", "reviewBody": "I ordered another one because the one I was previously using suddenly died on me (I've had it since I was in middle school and was used pretty heavily, so that might explain why some of the components expired or something). The slider is a bit annoying, but it is understandable why it is there. Overall, this is a good flash drive.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on January 11, 2021", "starRating": "4.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=12&reviewerType=all_reviews"}
{"names": "cyberbee17", "reviewerLink": "/gp/profile/amzn1.account.AEBEEOIMYRDX5XNZ53WFQY65L2YA", "reviewTitles": "SanDisk 128GB Cruzer Glide CZ60 USB 2.0 Flash Drive.", "reviewBody": "Fine storage capacity and seems to work. So far, the only downside is file transferring seems too slow for modern era. Much slower than 3.0 connected to 2.0 port. Also, as far as I can recall now, I've seen faster transferring with others USB 2.0 drives. Besides slow transferring, seems to work fine. If it holds up for years, that's still a very good deal even for nowadays.", "verifiedPurchase": "Verified Purchase", "postDate": "Reviewed in the United States on August 3, 2020", "starRating": "4.0 out of 5 stars", "helpful": "One person found this helpful", "nextPage": "/SanDisk-Cruzer-Glide-Drive-SDCZ60-032G-B35/product-reviews/B007YX9O9E?pageNumber=12&reviewerType=all_reviews"}
